config.org
#+TITLE: Emacs Config
#+DESCRIPTION: My personal Emacs configuration.

* About
This is my personal Emacs configuration using [[https://github.com/kwpav/basemacs][basemacs]]  at its core, [[https://github.com/emacs-evil/evil][Evil]] for editing, and [[https://github.com/joaotavora/eglot][Eglot]] (formerly [[https://emacs-lsp.github.io/lsp-mode/][LSP Mode]]) for coding. It is essentially cobbled together from bits and pieces of other configs I have found online. I have been tweaking it (and will probably continue to tweak it) for several years now.

It is a "Literate" config, where prose and code live together in harmony... what this basically means is that configuration code contained in this Org file, along with some text that describes what it's doing.
** How it Works
As with =basemacs=, this is as a literate config using Org mode, and all configuration is done (mostly) with =use-package=.  The code here is tangled using =org-babel-tangle=, it creates =init.el= and various "modules" in the =lisp/= directory.
* Startup
Let's get everything setup!
#+begin_src emacs-lisp :lexical t :tangle init.el
  ;;; init.el --- -*- lexical-binding: t no-byte-compile: t -*-
#+end_src

Add the =lisp/= directory to the =load-path= so we can load =basemacs-core=, modules, and any other custom lisp code.
#+begin_src emacs-lisp :lexical t :tangle init.el
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
#+end_src

Load the base config. This gives us =use-package= (along with some other handy packages) and some sane defaults to start with.
#+begin_src emacs-lisp :lexical t :tangle init.el
  (require 'basemacs-core)
#+end_src

Set up the leader keys for =general.el=.
#+begin_src emacs-lisp :lexical t :tangle init.el
  (use-package basemacs-core
    :custom
    (basemacs-leader "SPC")
    (basemacs-local-leader "SPC m"))
#+end_src
* Modules
Here is where the magic happens. Let's load some modules!
#+begin_src emacs-lisp :lexical t :tangle init.el
  ;; emacs
  (require 'kpav-defaults)
  (require 'kpav-system)
  (require 'kpav-evil)
  (require 'kpav-keys)
  (require 'kpav-narrowing)
  (require 'kpav-org)
  (require 'kpav-ui)
  (require 'kpav-windows-and-buffers)
  ;; tools
  (require 'kpav-project)
  (require 'kpav-git)
  (require 'kpav-vterm)
  (require 'kpav-docker)
  ;; code
  (require 'kpav-code)
  (require 'kpav-php)
  (require 'kpav-elisp)
  (require 'kpav-clojure)
  (require 'kpav-common-lisp)
  (require 'kpav-js)
  (require 'kpav-c)
  (require 'kpav-yaml)
  (require 'kpav-grpc)
  (require 'kpav-graphql)
#+end_src

All system specific configuration is done in =lisp/kpav-local.el=. This loads that file if it exists.
#+begin_src emacs-lisp :lexical t :tangle init.el
  (defconst kpav-local-file (expand-file-name "lisp/kpav-local.el" user-emacs-directory))

  (when (file-exists-p kpav-local-file)
    (load kpav-local-file))
#+end_src

This approach requires a bit more code than having this file just tangle to =init.el=, but I like the ability to easily turn on/off and change the order of things for tinkering and debugging purposes.
* Emacs
Things that modify Emacs itself.
** Opininionated Defaults
Some of my more "opinionated" default settings.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-defaults.el
  ;;; kpav-defaults.el --- -*- lexical-binding: t -*-
#+end_src
*** Start Screen
Display the =*scratch*= buffer at startup instead of the dashboard.
#+begin_src emacs-lisp :tangle lisp/kpav-defaults.el
  (use-package emacs
    :straight (:type built-in)
    :custom
    (inhibit-startup-screen t))
#+end_src

*** Pair Matching
Insert matching pairs for things like parens, brackets, quotes, etc. Use it in programming and org modes.
#+begin_src emacs-lisp :tangle lisp/kpav-defaults.el
  (use-package elec-pair
    :straight (:type built-in)
    :gfhook
    ('(prog-mode-hook org-mode-hook) #'electric-pair-mode))
#+end_src

Highlight paren when the cursor is over its matching pair. Also reduce the delay of it to =0= so it will be instant.
#+begin_src emacs-lisp :tangle lisp/kpav-defaults.el
  (use-package paren
    :straight (:type built-in)
    :custom
    (show-paren-delay 0)
    :config
    (show-paren-mode +1))
#+end_src

*** Files
Emacs likes to create lots of extra files for things, these settings prevent that. Also, create a newline at the end of the file on save.
#+begin_src emacs-lisp :tangle lisp/kpav-defaults.el
  (use-package files
    :straight (:type built-in)
    :custom
    (make-backup-files nil)    ;; stop creating backup~ files
    (auto-save-default nil)    ;; stop creating #autosave# files
    (create-lockfiles nil)     ;; stop creating .# files
    (require-final-newline t)) ;; auto add newline at the end of file
#+end_src

When you visit a file, point goes to the last place where it was when you previously visited the same file.
#+begin_src emacs-lisp :tangle lisp/kpav-defaults.el
  (use-package saveplace
    :straight (:type built-in)
    :config
    (save-place-mode +1))
#+end_src

*** Whitespace
Show whitespace and newlines.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-defaults.el
  (use-package emacs
    :straight (:type built-in)
    :gfhook
    ('(prog-mode-hook org-mode-hook)
     (lambda ()
       (setq show-trailing-whitespace t
             indicate-buffer-boundaries 'left))))
#+end_src

Periods should be followed by a single space, not double spaces
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-defaults.el
  (use-package emacs
    :straight (:type built-in)
    :config
    (setq sentence-end-double-space nil))
#+end_src

Use spaces for indentation, not tabs. Set the width to 4 instead of the default of 8.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-defaults.el
  (use-package emacs
    :straight (:type built-in)
    :config
    (setq-default indent-tabs-mode nil
                  tab-width 4))
#+end_src

*** Auto Saving
#+begin_quote
super-save auto-saves your buffers, when certain events happen - e.g. you switch between buffers, an Emacs frame loses focus, etc.
#+end_quote

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-defaults.el
  (use-package super-save
    :straight t
    :init
    :config
    (add-to-list 'super-save-triggers 'ace-window)
    (super-save-mode +1))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-defaults.el
  (provide 'kpav-defaults)
  ;;; kpav-defaults.el ends here
#+end_src
** Evil Mode
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-evil.el
  ;;; kpav-evil.el --- -*- lexical-binding: t -*-
#+end_src

Evil mode is vim in Emacs! Using =undo-fu= here instead of =undo-tree= as I have found that =undo-fu= seems to be quicker and less buggy than =undo-tree=.
#+begin_src emacs-lisp :tangle lisp/kpav-evil.el
  (use-package evil
    :straight t
    :general
    ;; make <tab> expand things in org mode for evil
    (general-nmap org-mode-map
      "<tab>" 'org-cycle)
    :init
    (use-package undo-fu :straight t)
    (setq evil-want-keybinding nil ;; evil-collection assumes this
          evil-undo-system 'undo-fu
          evil-disable-insert-state-bindings t) ;; emacs keys in insert mode
    :config
    (evil-mode +1))
#+end_src
The bit about using Emacs keybinds in evil mode is from https://stackoverflow.com/questions/25542097/emacs-evil-mode-how-to-change-insert-state-to-emacs-state-automatically

Use evil keys in various modes..
#+begin_src emacs-lisp :tangle lisp/kpav-evil.el
  (use-package evil-collection
    :straight t
    :after evil
    :config
    (evil-collection-init))
#+end_src

surround.vim emulation.
#+begin_src emacs-lisp :tangle lisp/kpav-evil.el
  (use-package evil-surround
    :straight t
    :after evil
    :config
    (global-evil-surround-mode +1))
#+end_src

vim-commentary emulation
#+begin_src emacs-lisp :tangle lisp/kpav-evil.el
  (use-package evil-commentary
    :straight t
    :config
    (evil-commentary-mode +1))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-evil.el
  (provide 'kpav-evil)
  ;;; kpav-evil.el ends here
#+end_src
** Keys
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-keys.el
  ;;; kpav-keys.el --- -*- lexical-binding: t -*-
#+end_src

Press any two keys for keybinds.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-keys.el
  (use-package key-chord
    :straight t
    :config
    (key-chord-mode +1))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-keys.el
  (provide 'kpav-keys)
  ;;; kpav-keys.el ends here
#+end_src
** UI
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  ;;; kpav-ui.el --- -*- lexical-binding: t -*-
#+end_src
*** Fonts
Set up fonts, This sets up the =default= typeface, and the ones to be used in [[*Variable Pitch][variable-pitch-mode,]] =variable-pitch= and =fixed-pitch=.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package faces
    :straight (:type built-in)
    :init
    ;; Main typeface
    ;; (set-face-attribute 'default nil :family "Iosevka" :height 130)
    (set-face-attribute 'default nil :family "Recursive Mn Lnr St" :height 130)
    ;; Proportionately spaced typeface
    ;; (set-face-attribute 'variable-pitch nil :family "EtBembo" :height 1.0)
    (set-face-attribute 'variable-pitch nil :family "Recursive Sn Lnr St" :height 1.0)
    ;; Monospaced typeface
    ;; (set-face-attribute 'fixed-pitch nil :family "Iosevka" :height 1.0))
    (set-face-attribute 'fixed-pitch nil :family "Recursive Mn Lnr St" :height 1.0))
#+end_src

Increase the line spacing to let the text breathe a bit.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package emacs
    :straight (:type built-in)
    :init
    (setq-default line-spacing 3))
#+end_src

*** Modus Themes
#+begin_quote
Accessible themes for GNU Emacs, conforming with the highest standard for colour contrast between background and foreground values (WCAG AAA)
#+end_quote

Modus themes are readable, clean looking, and super customizable. It also works very well with Org mode and Variable Pitch.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package modus-themes
    :straight t
    :init
    (setq modus-themes-mixed-fonts t
          modus-themes-bold-constructs t
          modus-themes-italic-constructs t
          modus-themes-intense-markup t
          modus-themes-completions '((matches . (extrabold background intense underline))
                                     (selection . (semibold background intense accented))
                                     (popup . (accented)))
          modus-themes-subtle-line-numbers t
          modus-themes-syntax '(faint alt-syntax)
          modus-themes-paren-match '(bold intense underline)
          modus-themes-region '(accented no-extend)
          modus-themes-mode-line '(borderless)
          ;; org specific settings
          modus-themes-org-blocks 'gray-background
          modus-themes-headings '((1 . (1.4))
                                  (2 . (1.2))
                                  (3 . (1.1))
                                  (t . (semibold)))
          modus-themes-scale-headings t)
    (modus-themes-load-themes)
    :config
    (modus-themes-load-vivendi))
#+end_src
*** Variable Pitch
=variable-pitch-mode= allows us to have multiple fonts in a single buffer. This is useful for =org-mode= which can have prose, code, and other things, in the same file.

Turn =variable-pitch-mode= on for =org-mode=.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package face-remap
    :straight (:type built-in)
    :gfhook
    ('org-mode-hook #'variable-pitch-mode))
#+end_src
*** Modeline
Set up for =doom-modeline=. Nice looking modeline that plays well with evil and lots of other stuff.

You need to run =M-x all-the-icons-install-fonts= to get the fancy fonts in the modeline

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package all-the-icons
    :straight t
    :defer t)
#+end_src

=column-number-mode= displays the cursors current line on the modeline
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package doom-modeline
    :straight t
    :demand t
    :preface
    :init
    (column-number-mode +1)
    (doom-modeline-mode +1)
    :custom
    (doom-modeline-vcs-max-length 50)
    (doom-modeline-buffer-file-name-style 'truncate-upto-project)
    (doom-modeline-modal-icon t)
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-indent-info nil))
#+end_src
*** Rainbow Delimiters
Add rainbow delimiters in all programming language modes
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (use-package rainbow-delimiters
    :straight t
    :ghook
    ('prog-mode-hook #'rainbow-delimiters-mode))
#+end_src
*** Cursor
Don't blink the cursor.
#+begin_src emacs-lisp :tangle lisp/kpav-ui.el
  (use-package frame
    :straight (:type built-in)
    :config
    (blink-cursor-mode -1))
#+end_src

Highlight the line the cursor is on.
#+begin_src emacs-lisp :tangle lisp/kpav-ui.el
  (use-package hl-line
    :straight (:type built-in)
    :config
    (global-hl-line-mode +1))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-ui.el
  (provide 'kpav-ui)
  ;;; kpav-ui.el ends here
#+end_src
** Windows and Buffers
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  ;;; kpav-windows-and-buffers.el --- -*- lexical-binding: t -*-
#+end_src
