config.org
*** Keys
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  (use-package window
    :straight (:type built-in)
    :general
    (base-leader-def
     :states 'normal
     "b" '(:ignore t :wk "buffers")
     "w" '(:ignore t :wk "windows")
     ;; "bb" 'switch-to-buffer
     ;; "bb" 'consult-buffer
     ;; "bk" 'kill-buffer
     "wo" 'split-window-horizontally
     "wu" 'split-window-vertically
     "wd" 'delete-window))
#+end_src
*** Navigation
Windmove provides a way to move around emacs windows.

Default keybindings are: ~S-arrowkey~ (e.g. ~S-Left~) to move around
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  (use-package windmove
    :straight (:type built-in)
    :general
    (base-leader-def
     :states 'normal
     "wh" 'windmove-left
     "wj" 'windmove-down
     "wk" 'windmove-up
     "wl" 'windmove-right)
    :config
    (windmove-default-keybindings))
#+end_src

ace-window lets you jump around windows with a single key
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  (use-package ace-window
    :straight t
    :general
    ("M-o" 'ace-window)
    (base-leader-def
      :states 'normal
      "ww" 'ace-window)
    :custom
    ;; use home row instead of numbers
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
#+end_src
*** COMMENT eyebrowse
Eyebrowse provides a way to manage workspaces like tiling window managers.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  (use-package eyebrowse
    :straight t
    :general
    (base-leader-def
      :states 'normal
      "w." 'eyebrowse-switch-to-window-config
      "w," 'eyebrowse-rename-window-config
      "w1" 'eyebrowse-switch-to-window-config-1
      "w2" 'eyebrowse-switch-to-window-config-2
      "w3" 'eyebrowse-switch-to-window-config-3
      "w4" 'eyebrowse-switch-to-window-config-4
      "w4" 'eyebrowse-switch-to-window-config-4
      "w5" 'eyebrowse-switch-to-window-config-5
      "w6" 'eyebrowse-switch-to-window-config-6
      "w7" 'eyebrowse-switch-to-window-config-7
      "w8" 'eyebrowse-switch-to-window-config-8
      "w9" 'eyebrowse-switch-to-window-config-9
      "w0" 'eyebrowse-switch-to-window-config-0)
    :config
    (eyebrowse-mode t))
#+end_src
*** perspective
Default key is ~C-x x~. Change it with =perp-mode-prefix-key=
Each frame gets its own perspective.
Switch buffer command only looks at current perspective
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  (use-package perspective
    :straight t
    :custom
    (persp-suppress-no-prefix-key-warning t)
    :general
    (base-leader-def
      :states 'normal
      "b`" 'persp-switch-by-number
      "bb" 'persp-switch-to-buffer
      "bk" 'persp-remove-buffer
      "bc" 'persp-kill
      "br" 'persp-rename
      "ba" 'persp-add-buffer
      "bA" 'persp-set-buffer
      "bi" 'persp-import
      "bn" 'persp-next
      "bp" 'persp-prev
      "bm" 'persp-merge
      "bu" 'persp-unmerge
      "bg" 'persp-add-buffer-to-frame-global
      "b C-s" 'persp-state-save
      "b C-l" 'persp-state-load
      "bs" 'persp-switch)
    :config
    (persp-mode +1))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-windows-and-buffers.el
  (provide 'kpav-windows-and-buffers)
  ;;; kpav-windows-and-buffers.el ends here
#+end_src
** Org Mode
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  ;;; kpav-org.el --- -*- lexical-binding: t -*-
#+end_src

- Use evil way of closing and quitting (=:q= =:x=) when editing code in org mode
- Define some keys
- Disable the checkdock check because most of my elisp code is in snippets in this config
- =org-use-fast-todo-selection=
  - Change the status of the todo state by pressing ~C-c C-c t <KEY>~
  - the =<KEY>= is the the letter in the parens after the state (e.g. =TODO(t)=)

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  (use-package org
    :straight t
    :general
    (org-src-mode-map
     [remap evil-save-and-close] 'org-edit-src-exit
     [remap evil-save-modified-and-close] 'org-edit-src-exit
     [remap evil-quit] 'org-edit-src-abort)
    (base-leader-def
      :states 'normal
      "a" 'org-agenda)
    (base-local-leader-def
      :keymaps 'org-mode-map
      :states 'normal
      "b" 'org-babel-tangle)
    :preface
    (defun my-disable-flycheck-for-elisp ()
      (setq flycheck-disabled-checkers '(emacs-lisp-checkdoc)))
    :gfhook
    ('org-src-mode-hook #'my-disable-flycheck-for-elisp)
    #'visual-line-mode
    :init
    (setq org-startup-indented t)
    :custom
    (org-agenda-files (list "~/org/agenda/"))
    (org-use-fast-todo-selection t)
    (org-todo-keywords
     '((sequence "TODO(t)" "NEXT(n)" "CURRENT(c)" "|" "DONE(d)")
       (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(a@/!)")))
    ;; Styling
    (org-auto-align-tags nil)
    (org-tags-column 0)
    (org-hide-emphasis-markers t)
    (org-pretty-entities t)
    (org-ellipsis "…"))
#+end_src

Install =org-contrib=
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  (use-package org-contrib
    :straight t)
#+end_src

Prettify headings and lists with =org-superstar-mode=
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  (use-package org-superstar
    :straight t
    :ghook
    ('org-mode-hook (lambda () (org-superstar-mode +1))))
#+end_src

Capture Templates
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  (use-package org-capture
    :straight nil
    :general
    (base-leader-def
      :states 'normal
      "C" 'org-capture)
    :custom
    (org-capture-templates
     '(("t" "Todo" entry (file+headline "~/org/agenda/todo.org" "Tasks")
        "* TODO %?\n %i\n %^{LINK}p")
       ("g" "Grow Log" entry (file+olp+datetree "~/grow/grow.org" "Log")
        "* Day Xn\n** Log\n** Notes\n %?\n %i\n"))))
#+end_src
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-org.el
  (provide 'kpav-org)
  ;;; kpav-org.el ends here
#+end_src
** Narrowing
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  ;;; kpav-narrowing.el --- -*- lexical-binding: t -*-
#+end_src
Set up Vertico and various packages that play well with it.
*** Vertico
Vertico comes with several extensions in an =extensions/= folder. These don't get automatically loaded with =:straight t=, so it needs a custom recipe.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (use-package vertico
    :straight (vertico :files (:defaults "extensions/*")
                       :includes (vertico-buffer
                                  vertico-directory
                                  vertico-flat
                                  vertico-indexed
                                  vertico-mouse
                                  vertico-quick
                                  vertico-repeat
                                  vertico-reverse))
    :init
    (vertico-mode +1))
#+end_src

The multiform extension allows configuration per command. Using reverse by default, which I like because what you type does not move positions. Using buffer for ripgrep results as the list could be long.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (use-package vertico-multiform
    :custom
    ;; (vertico-buffer-display-action
    ;;  (const :tag "Bottom of frame"
    ;;         (display-buffer-at-bottom
    ;;          (window-height . ,(+ 3 vertico-count)))))
    (vertico-multiform-commands
     '(;; (consult-ripgrep buffer)
       (t reverse)))
    :init
    (vertico-multiform-mode +1))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist
    :straight (:type built-in)
    :init
    (savehist-mode +1))

  ;; A few more useful configurations...
  (use-package emacs
    :straight (:type built-in)
    :init
    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
    ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
    ;; Vertico commands are hidden in normal buffers.
    (setq read-extended-command-predicate
          #'command-completion-default-include-p)
    ;; Enable recursive minibuffers
    (setq enable-recursive-minibuffers t))
#+end_src
*** Orderless
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (use-package orderless
    :straight t
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))))
#+end_src
*** ctrlf
#+begin_quote
a from scratch redesigned buffer-search interface
#+end_quote

A replacement for the built in I-Search. This replaces the evil search and the built in search. The bit in =general= handles evil and =ctrlf-mode= automatically redefines =C-s=.
- ~C-s~ - forward search
- ~C-r~ - backward search
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (use-package ctrlf
    :straight t
    :general
    (evil-normal-state-map "/" 'ctrlf-forward-fuzzy-regexp)
    :init
    (ctrlf-mode +1))
#+end_src
*** Marginalia
Marginalia adds information to the completions provided by Selectrum (keybinds, info about command, etc.)
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (use-package marginalia
    :straight t
    :general
    ("M-A" 'marginalia-cycle)
    (:keymaps
     'minibuffer-local-map
     "M-A" 'marginalia-cycle)
    :init
    (marginalia-mode +1))
#+end_src
*** Consult
#+begin_quote
Consult provides practical commands based on the Emacs completion function completing-read.
#+end_quote
Keys copied from projects README.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (use-package consult
    :after projectile ;; needed to set `consult-project-root-function'
    :straight t
    :general
    ;; C-c bindings (mode-specific-map)
    ("C-c h" 'consult-history)
    ("C-c m" 'consult-mode-command)
    ("C-c b" 'consult-bookmark)
    ("C-c k" 'consult-kmacro)
    ;; C-x bindings (ctl-x-map)
    ("C-x M-:" 'consult-complex-command)     ;; orig. repeat-complex-command
    ("C-x b" 'consult-buffer)                ;; orig. switch-to-buffer
    ("C-x 4 b" 'consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
    ("C-x 5 b" 'consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
    ;; Custom M-# bindings for fast register access
    ("M-#" 'consult-register-load)
    ("M-'" 'consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
    ("C-M-#" 'consult-register)
    ;; Other custom bindings
    ("M-y" 'consult-yank-pop)                ;; orig. yank-pop
    ("<help> a" 'consult-apropos)            ;; orig. apropos-command
    ;; M-g bindings (goto-map)
    ("M-g e" 'consult-compile-error)
    ("M-g f" 'consult-flycheck)              ;; Alternative: consult-flycheck
    ("M-g g" 'consult-goto-line)             ;; orig. goto-line
    ("M-g M-g" 'consult-goto-line)           ;; orig. goto-line
    ("M-g o" 'consult-outline)               ;; Alternative: consult-org-heading
    ("M-g m" 'consult-mark)
    ("M-g k" 'consult-global-mark)
    ("M-g i" 'consult-imenu)
    ("M-g I" 'consult-imenu-multi)
    ;; M-s bindings (search-map)
    ("M-s f" 'consult-find)
    ("M-s F" 'consult-locate)
    ("M-s g" 'consult-grep)
    ("M-s G" 'consult-git-grep)
    ("M-s r" 'consult-ripgrep)
    ("M-s l" 'consult-line)
    ("M-s L" 'consult-line-multi)
    ("M-s m" 'consult-multi-occur)
    ("M-s k" 'consult-keep-lines)
    ("M-s u" 'consult-focus-lines)
    ;; Isearch integration
    ("M-s e" 'consult-isearch)
    (:keymaps
     'isearch-mode-map
     "M-e" 'consult-isearch                 ;; orig. isearch-edit-string
     "M-s e" 'consult-isearch               ;; orig. isearch-edit-string
     "M-s l" 'consult-line                  ;; needed by consult-line to detect isearch
     "M-s L" 'consult-line-multi)           ;; needed by consult-line to detect isearch
    :init
    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0
          register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    ;; (advice-add #'register-preview :override #'consult-register-window)

    ;; Optionally replace `completing-read-multiple' with an enhanced version.
    (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)

    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)
    :config
    ;; projectile
    ;; for this ti work, either need to autoload it, or use :after projectile
    ;; (autoload 'projectile-project-root "projectile")
    (setq consult-project-root-function #'projectile-project-root)
    ;; project.el
    ;; (setq consult-project-root-function
    ;;       (lambda ()
    ;;         (when-let (project (project-current))
    ;;           (car (project-roots project)))))
    )
#+end_src
*** Embark
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (use-package embark
    :straight t
    :general
    ;; ("C-'" 'embark-act)
    ;; ("C-;" 'embark-dwim)
    ("C-h B" 'embark-bindings)
    ("C-;" 'embark-act)
    ("C-h B" 'embark-bindings) ;; alternative for `describe-bindings'
    :init
    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)
    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))

  ;; Consult users will also want the embark-consult package.
  (use-package embark-consult
    :straight t
    :after (embark consult)
    :demand t ; only necessary if you have the hook below
    ;; if you want to have consult previews as you move around an
    ;; auto-updating embark collect buffer
    :ghook
    ('embark-collect-mode #'consult-preview-at-point-mode))
#+end_src
