config.org
*** COMMENT Selectrum
Selectrum is a narrowing/completion system similiar to Ivy.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (use-package selectrum
    :straight t
    :demand t
    :ghook
    'after-init-hook)
#+end_src
*** COMMENT Prescient
#+begin_quote
Filter and sort results ... by frecency (a combination of frequency and recency).
#+end_quote
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (use-package prescient
    :straight t
    :after selectrum
    :config
    (prescient-persist-mode +1))

  (use-package selectrum-prescient
    :straight t
    :after (selectrum prescient)
    :init
    (selectrum-prescient-mode +1))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-narrowing.el
  (provide 'kpav-narrowing)
  ;;; kpav-narrowing.el ends here
#+end_src
** System Specific
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-system.el
  ;;; kpav-system.el --- -*- lexical-binding: t -*-
#+end_src

Ensure that Emacs uses the correct environment. This is especially useful for OSX, as Emacs may inherit a default set of environment variables, not the ones that you see in a terminal.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-system.el
  (use-package exec-path-from-shell
    :if (memq window-system '(mac ns x))
    :straight t
    :config
    (exec-path-from-shell-initialize))
#+end_src

The =railwaycat/emacs-mac= port maps the command key to meta, I like it bound to super because it matches my external keyboard better.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-system.el
  (use-package emacs
    :straight (:type built-in)
    :if (eq system-type 'darwin)
    :custom
    (mac-option-modifier 'meta)
    (mac-command-modifier 'super))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-system.el
  (provide 'kpav-system)
  ;;; kpav-system.el ends here
#+end_src
** Random
Make ~ESC~ close any prompts
#+begin_src emacs-lisp :lexical t :tangle init.el
  (use-package emacs
    :straight (:type built-in)
    :general
    ("<escape>" 'keyboard-escape-quit))
#+end_src

Stop warnings buffer from automatically coming up. (Emacs 28)
#+begin_src emacs-lisp :lexical t :tangle init.el
  (use-package emacs
    :straight (:type built-in)
    :init
    (setq native-comp-async-report-warnings-errors nil))
#+end_src

Get list of minor modes in current buffer
#+begin_src emacs-lisp :lexical t :tangle init.el
  (defun kpav/minor-modes ()
    (interactive)
    (completing-read
     "Minor modes: "
     local-minor-modes
     nil t))
#+end_src
* Tools
Add and configure some additional tools.
** Git
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  ;;; kpav-git.el --- -*- lexical-binding: t -*-
#+end_src
I only use =git= for version control, and I assume most  others do as well. This is probably why there are so many great =git= packages for Emacs!
*** magit
Magit may be one of the best front ends for =git= ever. It makes using git, both the simple and complex parts of it, easy and intuitive to use, right within Emacs! It also provides some neat stuff like =spinoff=, which will create a branch of any unpushed commits. This is handy if you accidentally starting commiting work to the wrong branch, e.g. =master= or =develop=.

I have a function here which copies the current branch name. This is handy if you need the branch name for something like a CI/CD system.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  (use-package magit
    :straight t
    :defer t
    :general
    ("C-x g" 'magit-status)
    (base-leader-def
      :states 'normal
      "g" '(:ignore t :wk "git")
      "gs" 'magit-status
      "gc" 'magit-checkout
      "gC" 'magit-commit
      "gb" 'magit-blame
      "gS" 'magit-stage-file
      "gU" 'magit-unstage-file
      "gy" 'kpav/magit-yank-branch-name)
    :config
    (defun kpav/magit-yank-branch-name ()
      "Show the current branch in the echo-area and add it to the `kill-ring'."
      (interactive)
      (let ((branch (magit-get-current-branch)))
        (if branch
            (progn (kill-new branch)
                   (message "%s" branch))
          (user-error "There is not current branch")))))
#+end_src
*** git-gutter-fringe
Add git change icons in the fringe, e.g. when somethings been added, changed, or removed. Modus themes makes this look decent.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  (use-package git-gutter-fringe
    :straight t
    :config
    (global-git-gutter-mode +1)
    (setq-default fringes-outside-margins t))
#+end_src
*** git-timemachine
Go through commit history on a file.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  (use-package git-timemachine
    :straight t
    :defer t
    :general
    (base-leader-def
      :states 'normal
      "gt" 'git-timemachine))
#+end_src
*** git-link
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  (use-package git-link
    :straight t
    :general
    (base-leader-def
      :states 'normal
      "gl" '(:ignore t :wk "git link")
      "gll" 'git-link
      "glc" 'git-link-commit
      "glh" 'git-link-homepage))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-git.el
  (provide 'kpav-git)
  ;;; kpav-git.el ends here
#+end_src
** Projects
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  ;;; kpav-project.el --- -*- lexical-binding: t -*-
#+end_src
A large part of my workflow is working in projects, which may or may not interact together, so I like to only open and interact with files and buffers on a per project basis. I use =perspective= to create perspectives for each project, then use the following packages to further interact with them, e.g. opening files or searching for some specific text.
*** project.el + projectile
Using a combination of the built-in =project.el= along with projectile. =project.el= works with marginalia to give extra info about files and buffers that projectile does not.

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  (use-package project
    ;;:straight (:type built-in)
    :straight t
    :general
    (base-leader-def
     :states 'normal
     "p" '(:ignore t :wk "projects")
     "pf" 'project-find-file
     "pb" 'project-switch-to-buffer))

  (use-package projectile
    :straight t
    :init
    (use-package ripgrep :straight t)
    :general
    (base-leader-def
     :states 'normal
     "p" '(:ignore t :wk "projects")
     "pd" 'projectile-find-dir
     "pp" 'projectile-switch-project
     "pP" 'projectile-switch-open-project
     "pg" 'consult-ripgrep
     "pG" 'consult-git-grep)
    :config
    (projectile-mode +1))
#+end_src
*** Treemacs
Treemacs provides a nice file explorer for projects.

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  (use-package treemacs
    :straight t
    :defer t
    :general
    ([f8] 'treemacs)
    (base-leader-def
      :states '(normal)
      "po" 'treemacs))

  (use-package treemacs-evil
    :straight t
    :after (evil treemacs))

  (use-package treemacs-magit
    :straight t
    :after (treemacs magit))
#+end_src
*** Direnv
Provide =direnv= support for projects with =.envrc= files.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  (use-package envrc
    :straight t
    :config
    (envrc-global-mode +1))
#+end_src

Use =envrc-allow= to explicitly run =direnv allow=.
*** Editorconfig
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  (use-package editorconfig
    :straight t
    :config
    (editorconfig-mode +1))
#+end_src
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-project.el
  (provide 'kpav-project)
  ;;; kpav-project.el ends here
#+end_src
** Terminal
*** vterm
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-vterm.el
  ;;; kpav-vterm.el --- -*- lexical-binding: t -*-
#+end_src

This provides a terminal emulator powered by libvterm. It is essentially a full terminal emulator.

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-vterm.el
  (use-package vterm
    :straight t)
#+end_src

Open multiple vterms. Evil configuration from it's README.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-vterm.el
  (use-package multi-vterm
    :straight t
    :general
    (base-leader-def
     :states 'normal
     "t" '(:ignore t :wk "term")
     "tt" 'multi-vterm
     "tn" 'multi-vterm-next
     "tp" 'multi-vterm-prev)
    :gfhook #'evil-insert-state
    :config
    (define-key vterm-mode-map [return]                      #'vterm-send-return)
    (setq vterm-keymap-exceptions nil)
    (evil-define-key 'insert vterm-mode-map (kbd "C-e")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-f")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-a")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-v")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-b")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-w")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-u")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-d")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-n")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-m")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-p")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-j")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-k")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-r")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-t")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-g")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-c")      #'vterm--self-insert)
    (evil-define-key 'insert vterm-mode-map (kbd "C-SPC")    #'vterm--self-insert)
    (evil-define-key 'normal vterm-mode-map (kbd "C-d")      #'vterm--self-insert)
    (evil-define-key 'normal vterm-mode-map (kbd ",c")       #'multi-vterm)
    (evil-define-key 'normal vterm-mode-map (kbd ",n")       #'multi-vterm-next)
    (evil-define-key 'normal vterm-mode-map (kbd ",p")       #'multi-vterm-prev)
    (evil-define-key 'normal vterm-mode-map (kbd "i")        #'evil-insert-resume)
    (evil-define-key 'normal vterm-mode-map (kbd "o")        #'evil-insert-resume)
    (evil-define-key 'normal vterm-mode-map (kbd "<return>") #'evil-insert-resume))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-vterm.el
  (provide 'kpav-vterm)
  ;;; kpav-vterm.el ends here
#+end_src
** Docker
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-docker.el
  ;;; kpav-docker.el --- -*- lexical-binding: t -*-
#+end_src

Get syntax highlighting for =Dockerfile= files
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-docker.el
  (use-package dockerfile-mode
    :straight t
    :defer t)
#+end_src

Use =docker= commands in Emacs
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-docker.el
  (use-package docker
    :straight t
    :defer t)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-docker.el
  (provide 'kpav-docker)
  ;;; kpav-docker.el ends here
#+end_src
* Code
Things that modify coding stuff (mostly programming langs and LSP).
** General
Things that can be used across all languages.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-code.el
  ;;; kpav-code.el --- -*- lexical-binding: t -*-
#+end_src

*** Code Completion
#+begin_quote
Company is a text completion framework for Emacs.
#+end_quote

=company= is essentially the standard package that is used for code completion. It works decently out of the box, has backends for nearly all languages, and is integrated with LSP.

#+begin_src emacs-lisp :tangle lisp/kpav-code.el
  (use-package company
    :straight t
    :config
    (global-company-mode +1))
#+end_src

*** Error Checking - Flymake
FlyMake is the built-in syntax checker for Emacs. It works for all (most?) of the languages that I use. Trying this out instead of *Flycheck* in my move to stick to built-in packages.

#+begin_src emacs-lisp :tangle lisp/kpav-code.el
  (use-package flymake
    :straight t
    :ghook
    ('prog-mode-hook #'flymake-mode-on))
#+end_src
*** COMMENT Error Checking - Flycheck
#+begin_quote
Flycheck is a modern on-the-fly syntax checking extension for GNU Emacs
#+end_quote

Flycheck works out of the box for just about everything and is integrated with lots of other packages.

#+begin_src emacs-lisp :tangle lisp/kpav-code.el
  (use-package flycheck
    :straight t
    :config
    (global-flycheck-mode +1))
#+end_src
*** Snippets
#+begin_quote
YA Snippet is a template system for Emacs.
#+end_quote

Set the snippets directory to be in this folder, automatically create it if it does not exist.
#+begin_src emacs-lisp :tangle lisp/kpav-code.el
  (use-package yasnippet
    :straight t
    :preface
    (defconst basemacs-snippets-dir (expand-file-name "snippets/" user-emacs-directory))
    (make-directory basemacs-snippets-dir :parents)
    :custom
    (yas-snippet-dirs (list basemacs-snippets-dir))
    :config
    (yas-global-mode +1))
#+end_src

Install the official snippet collection, this contains snippets for several programming languages.
#+begin_src emacs-lisp :tangle lisp/kpav-code.el
  (use-package yasnippet-snippets
    :straight t
    :after yasnippet)
#+end_src
