lisp/kpav-code.el
;;; kpav-code.el --- -*- lexical-binding: t -*-

(use-package company
  :straight t
  :config
  (global-company-mode +1))

(use-package flymake
  :straight t
  :ghook
  ('prog-mode-hook #'flymake-mode-on))

(use-package yasnippet
  :straight t
  :preface
  (defconst basemacs-snippets-dir (expand-file-name "snippets/" user-emacs-directory))
  (make-directory basemacs-snippets-dir :parents)
  :custom
  (yas-snippet-dirs (list basemacs-snippets-dir))
  :config
  (yas-global-mode +1))

(use-package yasnippet-snippets
  :straight t
  :after yasnippet)
