config.org
*** Eglot
#+BEGIN_QUOTE
Emacs Polyglot: an Emacs LSP client that stays out of your way:
#+END_QUOTE

A simple (compared to =lsp-mode=) way to use Language Servers in Emacs. It uses built-in commands (e.g. =xref-find-definitions=) and packages (e.g. =flymake=).

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-code.el
  (use-package eglot
    :straight t
    :general
    (base-leader-def
      :states '(normal visual)
      "l" '(:ignore :wk "lsp")
      "lg" 'xref-find-definitions
      "lr" 'xref-find-references
      "lf" 'eglot-format
      "lF" 'eglot-format-buffer
      "la" 'eglot-code-actions
      "lo" 'eglot-code-actions-organize-imports
      "lh" 'eldoc))
#+end_src

Although Eglot depends on built-in packages, it needs the newest versions of them.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-code.el
  (use-package eldoc
    :straight t)

  (use-package xref
    :straight t)
#+end_src
*** COMMENT LSP
#+BEGIN_QUOTE
The Language Server Protocol (LSP) defines the protocol used between an editor or IDE and a language server that provides language features like auto complete, go to definition, find all references etc.
#+END_QUOTE

Setup for Microsoft's (GASP!) Language Server Protocol. Any language that uses this calls =lsp= in the language mode's =:hook= / =:ghook=.

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-code.el
  (use-package lsp-mode
    :straight t
    :gfhook
    #'lsp-enable-which-key-integration
    :commands lsp
    :init
    (setq lsp-completion-provider :capf
          lsp-keymap-prefix "C-l")
    :custom
    ;; I don't find the headerline very helpful,
    ;; the modeline shows most of it anyway
    (lsp-headerline-breadcrumb-enable nil))

  (use-package lsp-ui
    :straight t
    :commands lsp-ui-mode
    :custom
    (lsp-ui-sideline-show-code-actions nil))

  (use-package lsp-treemacs
    :straight t
    :commands lsp-treemacs-errors-list)

  (use-package dap-mode
    :straight t
    :defer t)
#+end_src

Some handy links
- https://emacs-lsp.github.io/lsp-mode/page/performance/
*** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-code.el
  (provide 'kpav-code)
  ;;; kpav-code.el ends here
#+end_src
** Languages (and more)
*** Lisps
**** Shared
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  ;;; kpav-lisp-core.el --- -*- lexical-binding: t -*-
#+end_src

Lisps can share a lot of the same config code due to the nature of the syntax.

List of all lisp mode hooks. This is used to enable modes for all of them.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  (defconst kpav-lisp-mode-hooks
    '(lisp-mode-hook
      ;; sly-mrepl-mode-hook
      emacs-lisp-mode-hook
      clojure-mode-hook
      ;; cider-repl-mode-hook
      ))
#+end_src

Lispy provides vim-like commands to navigate and edit Lisp code.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  ;; (use-package lispy
  ;;   :straight t
  ;;   :ghook kpav-lisp-mode-hooks)

  ;; (use-package lispyville
  ;;   :straight t
  ;;   :ghook
  ;;   ('lispy-mode-hook #'lispyville-mode))
#+end_src

Symex provides even more vim-like commands (compared t0 lispy) to navigate and edit lisp code. Press ~C-'~ to start.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  (use-package symex
    :straight t
    :custom
    (symex-modal-backend 'evil)
    :general
    ("C-'" 'symex-mode-interface)
    (:keymaps 'normal
              (general-chord "jk") 'symex-mode-interface)
    :config
    (symex-initialize))
#+end_src
This is a nice guide:
https://countvajhula.com/2021/09/25/the-animated-guide-to-symex/

Automatically indent code.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  ;; (use-package aggressive-indent
  ;;   :straight t
  ;;   :ghook kpav-lisp-mode-hooks)
#+end_src
NOTE: commenting this out for now, useful for me, but not for work projects...too many whitespace changes.

Highlight whats being eval'ed
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  (use-package eval-sexp-fu
    :straight t
    :ghook
    (kpav-lisp-mode-hooks #'eval-sexp-fu-flash-mode))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-lisp-core.el
  (provide 'kpav-lisp-core)
  ;;; kpav-lisp-core.el ends here
#+end_src
**** Clojure
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  ;;; kpav-clojure.el --- -*- lexical-binding: t -*-
  (require 'kpav-lisp-core)
#+end_src

Use =clj-condo= and =flycheck=. This needs to be loaded before =clojure-mode= (note that =clj-kondo= needs to be installed on the local machine!)
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  (use-package flycheck-clj-kondo
    :straight t)
#+end_src

Use LSP with all clojure-related modes.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  (use-package clojure-mode
    :straight t
    :defer t
    :ghook
    ;; ('clojure-mode-hook #'lsp)
    ;; ('clojurec-mode-hook #'lsp)
    ;; ('clojurescript-mode #'lsp)
    ('clojure-mode-hook #'eglot-ensure)
    ('clojurec-mode-hook #'eglot-ensure)
    ('clojurescript-mode #'eglot-ensure)
    ;; :custom
    ;; (lsp-enable-indentation nil)
    :config
    (require 'flycheck-clj-kondo))
  ;; is this needed?
  ;; :config
  ;; (dolist (m '(clojure-mode
  ;;              clojurec-mode
  ;;              clojurescript-mode
  ;;              clojurex-mode))
  ;;   (add-to-list 'lsp-language-id-configuration `(,m . "clojure")))
#+end_src

#+begin_quote
CIDER is the Clojure(Script) Interactive Development Environment that Rocks!
#+end_quote
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  (use-package cider
    :straight t
    :after clojure-mode
    :ghook
    ('cider-repl-mode-hook #'rainbow-delimiters-mode)
    ;; ('cider-connected-hook #'cider-upgrade-nrepl-connection)
    :custom
    (cider-inject-dependencies-at-jack-in t)
    :general
    (base-local-leader-def
      :states '(normal visual)
      :keymaps 'clojure-mode-map
      "r" '(:ignore t :wk "repl")
      "rr" 'cider
      "rR" 'cider-restart
      "rn" 'cider-repl-set-ns
      "rb" 'cider-switch-to-repl-buffer
      "rc" 'cider-find-and-clear-repl-output
      "rl" 'cider-load-buffer
      "rq" 'cider-quit
      ;; eval
      "eD" 'cider-insert-defun-in-repl
      "eE" 'cider-insert-last-sexp-in-repl
      "eR" 'cider-insert-region-in-repl
      "eb" 'cider-eval-buffer
      "ed" 'cider-eval-defun-at-point
      "ee" 'cider-eval-last-sexp
      "er" 'cider-eval-region
      "eu" 'cider-undef
      "em" 'cider-macroexpand-1
      "eM" 'cider-macroexpand-all
      ;; help
      "h" '(:ignore t :wk "help")
      "ha" 'cider-apropos
      "hh" 'cider-doc
      "hj" 'cider-javadoc
      "hn" 'cider-browse-ns
      "hN" 'cider-browse-ns-all
      "hs" 'cider-browse-spec
      "hS" 'cider-browse-spec-all
      ;; inspect
      "i" '(:ignore t :wk "inspect")
      "ii" 'cider-inspect
      "ie" 'cider-enlighten-mode
      "ir" 'cider-inspect-last-result
      ;; pprint
      "p" '(:ignore t :wk "pprint")
      "pd" 'cider-pprint-eval-defun-at-point
      "pD" 'cider-pprint-eval-defun-to-comment
      "pD" 'cider-pprint-eval-last-sexp-to-repl
      ;; format
      "f" '(:ignore t :wk "format")
      "fr" 'cider-format-region
      "fb" 'cider-format-buffer
      "ff" 'cider-format-defun
      ;; goto
      "g" '(:ignore t :wk "goto")
      "gg" 'cider-find-var
      "gn" 'cider-find-ns
      "gN" 'cider-browse-ns-all
      "d" '(:ignore t :wk "debug")
      "dr" 'cider-ns-reload
      "dR" 'cider-ns-reload-all
      "di" 'cider-inspect-defun-at-point))
#+end_src

Refactoring functionality for Clojure.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  (use-package clj-refactor
    :straight t
    :after cider
    :ghook
    ('clojure-mode-hook (lambda ()
                          (clj-refactor-mode +1)
                          (yas-minor-mode +1) ; for adding require/use/import statements
                          ;; Leaves cider-macroexpand-1 unbound
                          (cljr-add-keybindings-with-prefix "C-c C-m")))
    :general
    (base-local-leader-def
      :states '(normal visual)
      :keymaps 'clojure-mode-map
      "R" 'hydra-cljr-help-menu/body))
#+end_src

Highlight what's being eval'ed
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  (use-package cider-eval-sexp-fu
    :straight t)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-clojure.el
  (provide 'kpav-clojure)
  ;;; kpav-clojure.el ends here
#+end_src
**** Common Lisp
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-common-lisp.el
  ;;; kpav-common-lisp.el --- -*- lexical-binding: t -*-
  (require 'kpav-lisp-core)
#+end_src

Sly provides a Common Lisp REPL for Emacs.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-common-lisp.el
  (use-package sly
    :straight t
    :defer t
    :ghook
    ('sly-mrepl-mode-hook #'rainbow-delimiters-mode)
    :general
    (base-local-leader-def
     :states 'normal
     :keymaps 'lisp-mode-map
     "eb" 'sly-eval-buffer
     "el" 'sly-eval-last-expression
     "ed" 'sly-eval-defun
     "er" 'sly-eval-region)
    :custom
    (inferior-lisp-program "/usr/bin/sbcl"))

  (use-package sly-quicklisp
    :straight t
    :after sly)

  (use-package sly-asdf
    :straight t
    :after sly)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-common-lisp.el
  (provide 'kpav-common-lisp)
  ;;; kpav-common-lisp.el ends here
#+end_src
**** Emacs Lisp
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-elisp.el
  ;;; kpav-elisp.el --- -*- lexical-binding: t -*-
  (require 'kpav-lisp-core)
#+end_src

Set up keys for evaling elisp.
#+BEGIN_src emacs-lisp :lexical t :tangle lisp/kpav-elisp.el
  (use-package emacs
    :straight (:type built-in)
    :general
    (base-local-leader-def
     :states 'normal
     :keymaps 'emacs-lisp-mode-map
     "e" '(:ignore t :wk "eval")
     "eb" 'eval-buffer
     "el" 'eval-last-sexp
     "ed" 'eval-defun
     "er" 'eval-region)
    (base-local-leader-def
     :states 'normal
     :keymaps 'lisp-interaction-mode-map
     "e" '(:ignore t :wk "eval")
     "eb" 'eval-buffer
     "el" 'eval-last-sexp
     "ed" 'eval-defun
     "er" 'eval-region))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-elisp.el
  (provide 'kpav-elisp)
  ;;; kpav-elisp.el ends here
#+end_src
