lisp/kpav-code.el

(use-package eglot
  :straight t
  :general
  (base-leader-def
    :states '(normal visual)
    "l" '(:ignore :wk "lsp")
    "lg" 'xref-find-definitions
    "lr" 'xref-find-references
    "lf" 'eglot-format
    "lF" 'eglot-format-buffer
    "la" 'eglot-code-actions
    "lo" 'eglot-code-actions-organize-imports
    "lh" 'eldoc))

(use-package eldoc
  :straight t)

(use-package xref
  :straight t)

(provide 'kpav-code)
;;; kpav-code.el ends here
