config.org
*** PHP
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  ;;; kpav-php.el --- -*- lexical-binding: t -*-
#+end_src

I use PHP for my job, so I need to use the =WellspringCodingStandard=.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (use-package php-mode
    :straight t
    :mode "\\.php\\'"
    :gfhook #'my-php-setup
    :general
    (:keymaps 'php-mode-map
      "C-c a" 'my/align-php-dbl-arrow)
    :custom
    ;; align -> on successive lines
    (php-lineup-cascaded-calls t)
    (flycheck-phpcs-standard "WellspringCodingStandard"))
#+end_src

Setup the default coding style and LSP for php. Need to set =lsp-enable-file-watchers= to nil because the project has a large amount of files and it causes performance issues.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (defun my-php-setup ()
    (php-enable-default-coding-style)
    (setq lsp-enable-file-watchers nil)
    (lsp))
#+end_src

Align the ==>= in arrays
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (defun my/align-php-dbl-arrow ()
    "Align the => in arrays."
    (interactive)
    (align-regexp
     (region-beginning) (region-end)
     "\\(\\s-*\\) => " 1 0 nil))
#+end_src

Use =PHP_CodeSniffer= to format files
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (use-package phpcbf
    :straight t
    :after (php-mode)
    :custom
    (phpcbf-executable "/usr/local/bin/phpcbf")
    (phpcbf-standard "WellspringCodingStandard"))
#+end_src

=psysh= is a php repl
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
  (use-package psysh
    :straight t
    :defer t)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-php.el
    (provide 'kpav-php)
    ;;; kpav-php.el ends here
#+end_src
*** JavaScript / TypeScript
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  ;;; kpav-js.el --- -*- lexical-binding: t -*-
#+end_src
**** JavasScript
Using the built in =js-mode=. This handles both vanilla js and =.jsx=.
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  (use-package js-mode
    :straight (:type built-in)
    :mode "\\.js\\'"
    :interpreter "node"
    :gfhook
    ;;#'lsp
    #'eglot-ensure)
#+end_src
**** TypeScript
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  (use-package typescript-mode
    :straight t
    :mode "\\.ts\\'"
    :commands (typescript-mode)
    :gfhook
    ;;#'lsp
    #'eglot-ensure)
#+end_src
**** JSON
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  (use-package json-mode
    :straight t
    :mode "\\.json\\'")
#+end_src
**** EOF
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-js.el
  (provide 'kpav-js)
  ;;; kpav-js.el ends here
#+end_src
*** C / C++
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-c.el
  ;;; kpav-c.el --- -*- lexical-binding: t -*-
#+end_src

Set up the =ccls= language server
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-c.el
  (use-package ccls
    :straight t
    :hook ((c-mode c++-mode objc-mode cuda-mode) .
           (lambda () (require 'ccls) (lsp)))
    :config
    (setq ccls-executable "/usr/bin/ccls")
    ;; use flycheck instead of flymake
    (setq lsp-prefer-flymake nil)
    (setq-default flycheck-disabled-checkers '(c/c++-clang c/c++-cppcheck c/c++-gcc)))
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-c.el
  (provide 'kpav-c)
  ;;; kpav-c.el ends here
#+end_src
*** YAML
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-yaml.el
  ;;; kpav-yaml.el --- -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-yaml.el
  (use-package yaml-mode
    :straight t
    :defer t)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-yaml.el
  (provide 'kpav-yaml)
  ;;; kpav-yaml.el ends here
#+end_src
*** gRPC
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-grpc.el
  ;;; kpav-grpc.el --- -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-grpc.el
  (use-package protobuf-mode
    :straight t
    :defer t)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-grpc.el
  (provide 'kpav-grpc)
  ;;; kpav-grpc.el ends here
#+end_src
*** GraphQL
#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-graphql.el
  ;;; kpav-graphql.el --- -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-graphql.el
  (use-package graphql-mode
    :straight t
    :defer t)
#+end_src

#+begin_src emacs-lisp :lexical t :tangle lisp/kpav-graphql.el
  (provide 'kpav-graphql)
  ;;; kpav-graphql.el ends here
#+end_src

* EOF
#+begin_src emacs-lisp :lexical t :tangle init.el
  (provide 'init)
  ;;; init.el ends here
#+end_src
* TODO To Do List
** TODO Test JS / TS stuff more
** TODO Add JS REPL (skewer?)
** TODO Add keys for LSP
jumping and stuff
** TODO Add Hydra
Should probably be in =basemacs-core=
** TODO Add keys for files, M-x, C-x?
e.g. ~SPC f~
** TODO Look into Selectrum and co. config more
See what other settings there are
** TODO Bookmark keys
** DONE Git keys
** TODO Look into TabNine / company-tabnine
AI completion engine?
** DONE Remove org from =basemacs-core= OR set :straight t
conflicts with other org customization
** DONE Remove magit from =basemacs-core=?
** TODO Look into Corfu to replace company
** TODO Use org-modern and make it look good
